tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_i2c.h
/**
  * @brief I2C_STOP Register Bit Definition
  */
#define  I2C_STOP_STOP_Pos                        (0)
#define  I2C_STOP_STOP_Msk                        (0x01U << I2C_STOP_STOP_Pos)                      /*!<Reading this register clears the STOP interrupt (I2C_RAWISR[9]).*/

/**
  * @brief I2C_START Register Bit Definition
  */
#define  I2C_START_START_Pos                      (0)
#define  I2C_START_START_Msk                      (0x01U << I2C_START_START_Pos)                    /*!<Reading this register clears the START interrupt (I2C_RAWISR[10]).*/

/**
  * @brief I2C_GC Register Bit Definition
  */
#define  I2C_GC_GC_Pos                            (0)
#define  I2C_GC_GC_Msk                            (0x01U << I2C_GC_GC_Pos)                          /*!<Reading this register clears the GC interrupt (I2C_RAWISR[11]).*/

/**
  * @brief I2C_ENR Register Bit Definition
  */
#define  I2C_ENR_ENABLE_Pos                       (0)
#define  I2C_ENR_ENABLE_Msk                       (0x01U << I2C_ENR_ENABLE_Pos)                     /*!<I2C module enable*/
#define  I2C_ENR_ABORT_Pos                        (1)
#define  I2C_ENR_ABORT_Msk                        (0x01U << I2C_ENR_ABORT_Pos)                      /*!<I2C transfer abort*/

/**
  * @brief I2C_SR Register Bit Definition
  */
#define  I2C_SR_ACTIV_Pos                         (0)
#define  I2C_SR_ACTIV_Msk                         (0x01U << I2C_SR_ACTIV_Pos)                       /*!<I2C activity status*/
#define  I2C_SR_TFNF_Pos                          (1)
#define  I2C_SR_TFNF_Msk                          (0x01U << I2C_SR_TFNF_Pos)                        /*!<Transmit FIFO not full*/
#define  I2C_SR_TFE_Pos                           (2)
#define  I2C_SR_TFE_Msk                           (0x01U << I2C_SR_TFE_Pos)                         /*!<Transmit FIFO completely empty*/
#define  I2C_SR_RFNE_Pos                          (3)
#define  I2C_SR_RFNE_Msk                          (0x01U << I2C_SR_RFNE_Pos)                        /*!<Receive FIFO not empty*/
#define  I2C_SR_RFF_Pos                           (4)
#define  I2C_SR_RFF_Msk                           (0x01U << I2C_SR_RFF_Pos)                         /*!<Receive FIFO completely full*/
#define  I2C_SR_MST_ACTIV_Pos                     (5)
#define  I2C_SR_MST_ACTIV_Msk                     (0x01U << I2C_SR_MST_ACTIV_Pos)                   /*!<Master FSM activity status*/
#define  I2C_SR_SLV_ACTIV_Pos                     (6)
#define  I2C_SR_SLV_ACTIV_Msk                     (0x01U << I2C_SR_SLV_ACTIV_Pos)                   /*!<Slave FSM activity status*/

/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define  I2C_TXFLR_CNT_Pos                        (0)
#define  I2C_TXFLR_CNT_Msk                        (0x01U << I2C_TXFLR_CNT_Pos)                      /*!<Contains the number of valid data entries in the transmit FIFO (0~2)*/

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define  I2C_RXFLR_CNT_Pos                        (0)
#define  I2C_RXFLR_CNT_Msk                        (0x01U << I2C_RXFLR_CNT_Pos)                      /*!<Contains the number of valid data entries in the receive FIFO (0~2)*/

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define  I2C_HOLD_TX_HOLD_Pos                     (0)
#define  I2C_HOLD_TX_HOLD_Msk                     (0xFFFFU << I2C_HOLD_TX_HOLD_Pos)                 /*!<Sets the SDA hold time (after SCL goes from high to low ) in units of APB clock period, when I2C device acts as a transmitter.*/
#define  I2C_HOLD_RX_HOLD_Pos                     (16)
#define  I2C_HOLD_RX_HOLD_Msk                     (0xFFU << I2C_HOLD_RX_HOLD_Pos)                   /*!<Sets the internal SDA hold time (valid while SCL is high) in units of APB clock period, when I2C device acts as a receiver.*/

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define  I2C_DMA_RXEN_Pos                         (0)
#define  I2C_DMA_RXEN_Msk                         (0x01U << I2C_DMA_RXEN_Pos)                       /*!<Receive DMA enable*/
#define  I2C_DMA_TXEN_Pos                         (1)
#define  I2C_DMA_TXEN_Msk                         (0x01U << I2C_DMA_TXEN_Pos)                       /*!<Transmit DMA enable*/

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define  I2C_SETUP_CNT_Pos                        (0)
#define  I2C_SETUP_CNT_Msk                        (0xFFU << I2C_SETUP_CNT_Pos)                      /*!<SDA setup time (min value is 2)*/

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define  I2C_GCR_GC_Pos                           (0)
#define  I2C_GCR_GC_Msk                           (0x01U << I2C_GCR_GC_Pos)                         /*!<ACK General Call*/

/**
  * @brief I2C_SLVMASK Register Bit Definition
  */
#define  I2C_SLVMASK_MASK_Pos                     (0)
#define  I2C_SLVMASK_MASK_Msk                     (0x03FFU << I2C_SLVMASK_MASK_Pos)                 /*!<Slave address mask*/

/**
  * @brief I2C_SLVRCVADDR Register Bit Definition
  */
#define  I2C_SLVRCVADDR_ADDR_Pos                  (0)
#define  I2C_SLVRCVADDR_ADDR_Msk                  (0x03FFU << I2C_SLVRCVADDR_ADDR_Pos)              /*!<Slave address actually received by I2C*/


#endif

